In [3]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [4]:
df = pd.read_csv("../data/total_production_v1.csv")
df.head()

,Crop year,Unnamed: 1,1990/91,1991/92,1992/93,1993/94,1994/95,1995/96,1996/97,1997/98,...,2010/11,2011/12,2012/13,2013/14,2014/15,2015/16,2016/17,2017/18,2018/19,2019/20
0,April group,NaN,40795,42530,46868,40167,39990,29396,44298,39476,...,71811,64395,75896,74494,69873,71332,75508,70324,81708,76076
1,Angola,(R/A),50,79,78,33,77,62,71,64,...,35,29,33,35,39,41,45,35,42,52
2,Bolivia (Plurinational State of),(A),123,104,120,51,117,142,125,141,...,117,132,105,120,100,84,78,84,83,81
3,Brazil,(A/R),27286,27293,34603,28167,28192,18060,29197,26148,...,55428,48592,55418,54689,53305,52871,56788,52740,65131,58211
4,Burundi,(A/R),487,667,620,393,664,434,401,250,...,353,204,406,163,248,269,196,202,204,272

In [5]:
# Remove unnecessary columns
df = df.drop(columns="Unnamed: 1")
df.head()

,Crop year,1990/91,1991/92,1992/93,1993/94,1994/95,1995/96,1996/97,1997/98,1998/99,...,2010/11,2011/12,2012/13,2013/14,2014/15,2015/16,2016/17,2017/18,2018/19,2019/20
0,April group,40795,42530,46868,40167,39990,29396,44298,39476,50892,...,71811,64395,75896,74494,69873,71332,75508,70324,81708,76076
1,Angola,50,79,78,33,77,62,71,64,85,...,35,29,33,35,39,41,45,35,42,52
2,Bolivia (Plurinational State of),123,104,120,51,117,142,125,141,138,...,117,132,105,120,100,84,78,84,83,81
3,Brazil,27286,27293,34603,28167,28192,18060,29197,26148,36761,...,55428,48592,55418,54689,53305,52871,56788,52740,65131,58211
4,Burundi,487,667,620,393,664,434,401,250,492,...,353,204,406,163,248,269,196,202,204,272

In [6]:
# Melt column years where column year turns to column value
df = df.melt(id_vars=["Crop year"], var_name="year", value_name="units")
df.head()

                          Crop year     year  units
0                       April group  1990/91  40795
1                            Angola  1990/91     50
2  Bolivia (Plurinational State of)  1990/91    123
3                            Brazil  1990/91  27286
4                           Burundi  1990/91    487

In [7]:
# Rename columns: rename, crop year to country
df = df.rename(columns={"Crop year": "country"})

In [8]:
df

                               country     year   units
0                          April group  1990/91   40795
1                               Angola  1990/91      50
2     Bolivia (Plurinational State of)  1990/91     123
3                               Brazil  1990/91   27286
4                              Burundi  1990/91     487
...                                ...      ...     ...
1765                            Uganda  2019/20    5509
1766                         Venezuela  2019/20     650
1767                          Viet Nam  2019/20   30487
1768                             Yemen  2019/20      91
1769                             Total  2019/20  165053

[1770 rows x 3 columns]

In [10]:
def assign_country_groups(df, group_name, country_list):
  df2 = pd.DataFrame(df[df["country"].isin(country_list)])
  df2.loc[:, "group"] = np.repeat(group_name, len(df2.index))
  return df2

In [28]:
# Get list of individual countries based on their groups
# countries = df["country"].unique().tolist()
# num_countries = len(countries)

# countries.index("group")

ValueError: 'group' is not in list